# Найдите и выведите на экран top-10 самых популярных персонажей 
# в комедии "Ревизор" (файл revizor.txt) среди тех, которые упоминаются 
# в ней по имени и отчеству. «Лишние» словосочетания, не являющиеся именем
# и отчеством, и встречающиеся, например, в начале предложения, можно не исключать.

# Количество пробелов между именем и отчеством может быть разное, на вашей 
# статистике это сказаться не должно.

# Различные словоформы (число, падеж) можно не сводить в одну строчку

# Первые три персонажа из данного списка появляются в произведении 35, 17 и 13 раз
# соответственно
